<a href="https://colab.research.google.com/github/euviniciusmendonca/estudo_python/blob/main/pandas_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Instalação das Bibliotecas necessárias.

In [ ]:
import pandas as pd
import sqlalchemy

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.1 MB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

#### Engine de Conexão ao Banco de Dados MySQL.

Sintaxe:<br>
engine = sqlalchemy.create_engine(
'mysql+**drive**://**usuario**:**senha**@**ip-servidor**:**porta**/**banco-de-dados**')

#### Documentação do SQLAlchemy.

https://docs.sqlalchemy.org/en/latest/core/engines.html

#### Criando a Conexão.

In [ ]:
engine = sqlalchemy.create_engine('mysql+pymysql://admin:DNCasdf1234!@pd-database-dataexpert.ccxrrioevqcs.us-east-1.rds.amazonaws.com:3306/databasedataexpert')

## Método:  read_sql_table

#### Paramentros do método read_sql_table

* **table_name** = Nome da tabela onde será feita a leitura dos dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema**= Schema onde a tabela está armazenada.
* **index_col** = Coluna a ser definida como index.
<br>...

#### Lendo toda a tabela Employees e transformando em DataFrame.

In [ ]:
df = pd.read_sql_table('Athletes',engine)

#### Listando os dados e informações dos atributos.

In [ ]:
df.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   GameId         30 non-null     int64
 1   Team1Id        30 non-null     int64
 2   Team2Id        30 non-null     int64
 3   ResultOfTeam1  30 non-null     int64
 4   URL            30 non-null     object
 5   Date           30 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 1.5+ KB

**Lendo apenas algumas colunas da tabela.**

In [ ]:
df = pd.read_sql_table('nba_game', engine, columns=["Team1Id","Date"])

In [ ]:
df.head()

   Team1Id       Date
0        7 2014-03-31
1        9 2014-03-31
2       11 2014-03-31
3       13 2014-03-31
4       15 2014-03-31

## Método:  read_sql_query

#### Paramentros do método read_sql_query

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando um DataFrame apartir de uma query ao banco de dados.

In [ ]:
df = pd.read_sql_query("select * from nba_game",engine)

In [ ]:
df.head()

   GameId  ...       Date
0       1  ... 2014-03-31
1       2  ... 2014-03-31
2       3  ... 2014-03-31
3       4  ... 2014-03-31
4       5  ... 2014-03-31

[5 rows x 6 columns]

#### Criando um DataFrame apartir de uma query ao banco de dados utilizando a coluna emp_no com index.

In [ ]:
df_index = pd.read_sql_query("select * from nba_game",engine,index_col="GameId")

In [ ]:
df_index.head()

        Team1Id  ...       Date
GameId           ...
1             7  ... 2014-03-31
2             9  ... 2014-03-31
3            11  ... 2014-03-31
4            13  ... 2014-03-31
5            15  ... 2014-03-31

[5 rows x 5 columns]

#### Criando um DataFrame apartir de uma query ligando várias tabelas.

In [ ]:
query = '''
SELECT  play.PlayerId,
        play.PlayerName,
        sum(act.Points) as Score,
        gam.Date
FROM nba_player play
INNER JOIN nba_actions act
ON play.PlayerId = act.PlayerId
INNER JOIN nba_game gam
ON act.GameId = gam.GameId
GROUP BY play.PlayerId;
'''

In [ ]:
df = pd.read_sql_query(query,engine)

In [ ]:
df.head()

   PlayerId         PlayerName  Score       Date
0         1      Nicolas Batum   16.0 2014-04-01
1         2  LaMarcus Aldridge   31.0 2014-04-01
2         3        Robin Lopez   10.0 2014-04-01
3         4    Wesley Matthews   10.0 2014-04-01
4         5     Damian Lillard   34.0 2014-04-01

#### Criando um DataFrame apartir de uma query utilizando parametros dinâmicos.

In [ ]:
query = 'SELECT PlayerId, PlayerName ' \
      'FROM nba_player ' \
      'WHERE PlayerName = %s'

In [ ]:
df = pd.read_sql_query(query, engine,params=["Wesley Matthews"])

In [ ]:
df.head()

   PlayerId       PlayerName
0         4  Wesley Matthews

#### Criando um DataFrame apartir de uma query utilizando parametros nomeados.

In [ ]:
query = '''
SELECT  play.PlayerId,
        play.PlayerName,
        sum(act.Points) as Score,
        gam.Date
FROM nba_player play
INNER JOIN nba_actions act
ON play.PlayerId = act.PlayerId
INNER JOIN nba_game gam
ON act.GameId = gam.GameId
WHERE gam.Date >= %(data_inicial)s AND play.PlayerName = %(nome)s
GROUP BY play.PlayerId;
'''

In [ ]:
import http

In [ ]:
df = pd.read_sql_query(query, 
                       engine,
                       params={'data_inicial':"2014-04-02 00:00:00",
                                'nome':"Hidayet Turkoglu"}
                      )

In [ ]:
df.head()

   PlayerId        PlayerName  Score       Date
0       169  Hidayet Turkoglu    2.0 2014-04-02

## Método:  read_sql

#### Faz o roteamento entre os métodos read_table e read_sql_query.

#### Paramentros do método read_sql.

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando o DataFrame passando apenas o nome da tabela para o método.

In [ ]:
df = pd.read_sql("nba_game",engine)

In [ ]:
df.head()

   GameId  ...       Date
0       1  ... 2014-03-31
1       2  ... 2014-03-31
2       3  ... 2014-03-31
3       4  ... 2014-03-31
4       5  ... 2014-03-31

[5 rows x 6 columns]

#### Criando o DataFrame através de uma query.

In [ ]:
df = pd.read_sql("SELECT * FROM nba_game",engine)

In [ ]:
df.head()

   GameId  ...       Date
0       1  ... 2014-03-31
1       2  ... 2014-03-31
2       3  ... 2014-03-31
3       4  ... 2014-03-31
4       5  ... 2014-03-31

[5 rows x 6 columns]

## Método:  to_sql

#### Escreve o DataFrame para o Banco de Dados Relacional.

#### Carregando a base de dados e criando o DataFrame.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
df = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/DS/materiais-de-apoio-pandas-sql-banco-dados/Teams.xlsx")

In [ ]:
df.head(20)

             Name      Discipline                         NOC         Event
0         Belgium  3x3 Basketball                     Belgium           Men
1           China  3x3 Basketball  People's Republic of China           Men
2           China  3x3 Basketball  People's Republic of China         Women
3          France  3x3 Basketball                      France         Women
4           Italy  3x3 Basketball                       Italy         Women
5           Japan  3x3 Basketball                       Japan           Men
6           Japan  3x3 Basketball                       Japan         Women
7          Latvia  3x3 Basketball                      Latvia           Men
8        Mongolia  3x3 Basketball                    Mongolia         Women
9     Netherlands  3x3 Basketball                 Netherlands           Men
10         Poland  3x3 Basketball                      Poland           Men
11            ROC  3x3 Basketball                         ROC           Men
12            ROC  3x3 Basketball                         ROC         Women
13        Romania  3x3 Basketball                     Romania         Women
14         Serbia  3x3 Basketball                      Serbia           Men
15  United States  3x3 Basketball    United States of America         Women
16      Australia         Archery                   Australia    Men's Team
17      Australia         Archery                   Australia    Mixed Team
18     Bangladesh         Archery                  Bangladesh    Mixed Team
19        Belarus         Archery                     Belarus  Women's Team

#### Paramentros do método to_sql.

* **name** = Nome da tabela que será criada no SGBD.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema** = Nome do Schema onde será criada a tabela.
* **if_exists**= Comportamento caso a tabela exista no SGBD.
* **index**= Escreve o índice do DataFrame como uma coluna da tabela.
* **index_label**= Nome da coluna de índice.

**Criando a tabela no Banco de Dados a partir do DataFrame.**

In [ ]:
df.to_sql(
    name = 'ocorrencia',
    con = engine,
)

**Criando a tabela no Banco de Dados sem a coluna de índice.**

In [ ]:
df.to_sql(
    name = 'Teams',
    con = engine,
    index = False,
    if_exists ='append'
)